Revit 2026 API
Transaction.SetFailureHandlingOptions Method
 Sets options for handling failures to be used when the transaction is being committed or rolled back.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void SetFailureHandlingOptions(
	FailureHandlingOptions options
)
Public Sub SetFailureHandlingOptions (
	options As FailureHandlingOptions
)
public:
void SetFailureHandlingOptions(
	FailureHandlingOptions^ options
)
member SetFailureHandlingOptions :
        options : FailureHandlingOptions -> unit
Parameters
options FailureHandlingOptions
 An instance of FailureHandlingOptions to be applied to the transaction
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Options can be set at any time before the transaction is either committed or rolled back. See FailureHandlingOptions for details about available options. Once committed or rolled back, the transaction object will reset its options to their default values.
See Also
Reference
Transaction Class
Autodesk.Revit.DB Namespace